---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyUsePrecutShape
source: html/aac3feed-e689-950d-23a1-baf22d575157.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyUsePrecutShape Property

"Show family pre-cut in plan views"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyUsePrecutShape { get; }
```